app/controllers/file_storages_controller.rb

INSERT INTO "file_storages" ("file_name", "object_key", "file_type") VALUES (?, ?, ?)  [["file_name", "teste.jpg"], ["object_key", "ce869d9d-2d40-46f7-8b6a-e94f786450cd-teste.jpg"], ["file_type", 0]]
---
  def create
    @file_storage = FileStorage.create(file_params)

SELECT  "file_storages".* FROM "file_storages" WHERE "file_storages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @file_storage = FileStorage.find(params[:id])